@echo off
chcp 65001
mkdir C:\Users\Миша\Лабораторные\ПЗ-22-2\КривоносовМС\batch\Скрытая_папка
mkdir C:\Users\Миша\Лабораторные\ПЗ-22-2\КривоносовМС\batch\Не_скрытая_папка
attrib +h C:\Users\Миша\Лабораторные\ПЗ-22-2\КривоносовМС\batch\Скрытая_папка
xcopy /? > C:\Users\Миша\Лабораторные\ПЗ-22-2\КривоносовМС\batch\Не_скрытая_папка\copyhelp.txt
xcopy C:\Users\Миша\Лабораторные\ПЗ-22-2\КривоносовМС\batch\Не_скрытая_папка\copyhelp.txt C:\Users\Миша\Лабораторные\ПЗ-22-2\КривоносовМС\batch\Скрытая_папка\copied_copyhelp.txt
